RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_dcu.c
/**
 *******************************************************************************
 * @file  hc32f4a0_dcu.c
 * @brief This file provides firmware functions to manage the DCU(Data Computing
 *        Unit).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hongjh          First version
   2020-07-23       Hongjh          1. Modify macro define for interrupt, flag and mode;
                                    2. Rename API: from DCU_IntFuncCmd to DCU_GlobalIntCmd;
                                    3. Refine API: DCU_IntCmd and delete DCU_SetCmpIntMode;
                                    4. Refine API: DCU DATA read/write.
   2020-09-07       Hongjh          Refine API: DCU_SetTriggerSrc
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_dcu.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_DCU DCU
 * @brief DCU Driver Library
 * @{
 */

#if (DDL_DCU_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup DCU_Local_Macros DCU Local Macros
 * @{
 */

/**
 * @defgroup DCU_Check_Parameters_Validity DCU Check Parameters Validity
 * @{
 */
#define IS_DCU_BASE_FUNC_UNIT(x)                                               \
(   (M4_DCU5 == (x))                            ||                             \
    (M4_DCU6 == (x))                            ||                             \
    (M4_DCU7 == (x))                            ||                             \
    (M4_DCU8 == (x)))

#define IS_DCU_WAVE_FUNC_UNIT(x)                                               \
(   (M4_DCU1 == (x))                            ||                             \
    (M4_DCU2 == (x))                            ||                             \
    (M4_DCU3 == (x))                            ||                             \
    (M4_DCU4 == (x)))

#define IS_DCU_UNIT(x)                                                         \
(   (IS_DCU_BASE_FUNC_UNIT(x))                  ||                             \
    (IS_DCU_WAVE_FUNC_UNIT(x)))

#define IS_DCU_BASE_FUNC_UNIT_MODE(x)                                          \
(   (DCU_CMP == (x))                            ||                             \
    (DCU_ADD == (x))                            ||                             \
    (DCU_SUB == (x))                            ||                             \
    (DCU_HW_ADD == (x))                         ||                             \
    (DCU_HW_SUB == (x)))

#define IS_DCU_WAVE_FUNC_UNIT_MODE(x)                                          \
(   (DCU_CMP == (x))                            ||                             \
    (DCU_ADD == (x))                            ||                             \
    (DCU_SUB == (x))                            ||                             \
    (DCU_HW_ADD == (x))                         ||                             \
    (DCU_HW_SUB == (x))                         ||                             \
    (DCU_TRIANGLE_WAVE == (x))                  ||                             \
    (DCU_SAWTOOTH_WAVE_INC == (x))              ||                             \
    (DCU_SAWTOOTH_WAVE_DEC == (x)))

#define IS_DCU_BASE_FUNC_UNIT_INT(x)                                           \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~DCU_BASE_FUNC_UNIT_INT_MASK))))

#define IS_DCU_WAVE_FUNC_UNIT_INT(x)                                           \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~DCU_WAVE_FUNC_UNIT_INT_MASK))))

#define IS_DCU_BASE_FUNC_UNIT_FLAG(x)                                          \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~DCU_BASE_FUNC_UNIT_FLAG_MASK))))

#define IS_DCU_WAVE_FUNC_UNIT_FLAG(x)                                          \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~DCU_WAVE_FUNC_UNIT_FLAG_MASK))))

#define IS_DCU_INTERRUPT_STATE(x)                                              \
(   (DCU_INT_ENABLE == (x))                     ||                             \
    (DCU_INT_DISABLE == (x)))

#define IS_DCU_CMP_TRIG_MODE(x)                                                \
(   (DCU_CMP_TRIG_DATA0 == (x))                 ||                             \
    (DCU_CMP_TRIG_DATA012 == (x)))

#define IS_DCU_DATA_SIZE(x)                                                    \
(   (DCU_DATA_SIZE_8BIT == (x))                 ||                             \
    (DCU_DATA_SIZE_16BIT == (x))                ||                             \
    (DCU_DATA_SIZE_32BIT == (x)))

#define IS_DCU_INT_CATEGORY(x)                                                 \
(   ((x) == DCU_INT_OP)                         ||                             \
    ((x) == DCU_INT_WAVE_MD)                    ||                             \
    ((x) == DCU_INT_CMP_WIN)                    ||                             \
    ((x) == DCU_INT_CMP_NON_WIN))

#define IS_DCU_INT_OP(x)                        ((x) == DCU_INT_OP_UDF_OVF)

#define IS_DCU_INT_CMP_WIN(x)                                                  \
(   ((x) != 0UL)                                &&                             \
    (((x) | DCU_INT_CMP_WIN_ALL) == DCU_INT_CMP_WIN_ALL))

#define IS_DCU_INT_WAVE_MD(x)                                                  \
(   ((x) != 0UL)                                &&                             \
    (((x) | DCU_INT_WAVE_MD_ALL) == DCU_INT_WAVE_MD_ALL))

#define IS_DCU_INT_CMP_NON_WIN(x)                                              \
(   ((x) != 0UL)                                ||                             \
    (((x) | DCU_INT_CMP_NON_WIN_ALL) == DCU_INT_CMP_NON_WIN_ALL))

#define IS_DCU_DATA_REG(x)                                                     \
(   ((x) == DCU_DATA0_IDX)                      ||                             \
    ((x) == DCU_DATA1_IDX)                      ||                             \
    ((x) == DCU_DATA2_IDX))

#define IS_DCU_COM_TRIG(x)                                                     \
(   (0UL != (x))                                &&                             \
    (0UL == ((x) & (~DCU_COM_TRIG_MASK))))

#define IS_DCU_WAVE_UPPER_LIMIT(x)              ((x) <= 0xFFFUL)

#define IS_DCU_WAVE_LOWER_LIMIT(x)              ((x) <= 0xFFFUL)

#define IS_DCU_WAVE_STEP(x)                     ((x) <= 0xFFFUL)
/**
 * @}
 */

/**
 * @defgroup DCU_Flag_Mask DCU Flag Mask
 * @{
 */
#define DCU_BASE_FUNC_UNIT_FLAG_MASK                                           \
(   DCU_FLAG_DATA0_LS_DATA2                     |                              \
    DCU_FLAG_DATA0_EQ_DATA2                     |                              \
    DCU_FLAG_DATA0_GT_DATA2                     |                              \
    DCU_FLAG_DATA0_LS_DATA1                     |                              \
    DCU_FLAG_DATA0_EQ_DATA1                     |                              \
    DCU_FLAG_DATA0_GT_DATA1)

