RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_dcu.c
#define DCU_WAVE_FUNC_UNIT_FLAG_MASK                                           \
(   DCU_FLAG_OPERATION                          |                              \
    DCU_FLAG_DATA0_LS_DATA2                     |                              \
    DCU_FLAG_DATA0_EQ_DATA2                     |                              \
    DCU_FLAG_DATA0_GT_DATA2                     |                              \
    DCU_FLAG_DATA0_LS_DATA1                     |                              \
    DCU_FLAG_DATA0_EQ_DATA1                     |                              \
    DCU_FLAG_DATA0_GT_DATA1                     |                              \
    DCU_FLAG_WAVE_SAWTOOTH_RELOAD               |                              \
    DCU_FLAG_WAVE_TRIANGLE_BOTTOM               |                              \
    DCU_FLAG_WAVE_TRIANGLE_TOP)
/**
 * @}
 */

#define DCU_DATA1_LOWER_LIMIT_POS               (0UL)
#define DCU_DATA1_LOWER_LIMIT                   (0x00000FFFUL)

#define DCU_DATA1_UPPER_LIMIT_POS               (16UL)
#define DCU_DATA1_UPPER_LIMIT                   (0x0FFF0000UL)

/**
 * @defgroup DCU_Register_Address Get DCU register address
 * @{
 */
#define REG_ADDR(__REG__)                       ((uint32_t)(&(__REG__)))
#define DATA_REG_ADDR(__DCUx__, __IDX__)        (REG_ADDR((__DCUx__)->DATA0) + ((__IDX__) << 2UL))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/**
 * @addtogroup DCU_Local_Functions
 * @{
 */
static __IO uint32_t* DCU_TRGSELx(const M4_DCU_TypeDef *DCUx);
/**
 * @}
 */

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup DCU_Global_Functions DCU Global Functions
 * @{
 */

/**
 * @brief  Initialize DCU function.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_dcu_init_t structure (DCU function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit is NULL pointer
 */
en_result_t DCU_Init(M4_DCU_TypeDef *DCUx, const stc_dcu_init_t *pstcInit)
{
    uint32_t u32RegVal;
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != pstcInit)
    {
        DDL_ASSERT((IS_DCU_WAVE_FUNC_UNIT(DCUx) && IS_DCU_WAVE_FUNC_UNIT_MODE(pstcInit->u32Mode)) || \
                   (IS_DCU_BASE_FUNC_UNIT(DCUx) && IS_DCU_BASE_FUNC_UNIT_MODE(pstcInit->u32Mode)));
        DDL_ASSERT(IS_DCU_DATA_SIZE(pstcInit->u32DataSize));
        DDL_ASSERT(IS_DCU_INTERRUPT_STATE(pstcInit->u32IntEn));
        DDL_ASSERT(IS_DCU_CMP_TRIG_MODE(pstcInit->u32CmpTriggerMode));

        /* De-initialize DCU */
        WRITE_REG32(DCUx->CTL, 0x00000000UL);
        WRITE_REG32(DCUx->INTEVTSEL, 0x00000000UL);
        WRITE_REG32(DCUx->FLAGCLR, (IS_DCU_WAVE_FUNC_UNIT(DCUx)) ? 0x00000E7FUL:0x0000007FUL);

        /* Set register: CTL */
        u32RegVal = (pstcInit->u32Mode | \
                     pstcInit->u32DataSize | \
                     pstcInit->u32CmpTriggerMode | \
                     pstcInit->u32IntEn);
        WRITE_REG32(DCUx->CTL, u32RegVal);

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_uart_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_dcu_init_t structure (DCU function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: pstcInit is NULL pointer
 */
en_result_t DCU_StructInit(stc_dcu_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcInit)
    {
        pstcInit->u32Mode = DCU_SUB;
        pstcInit->u32DataSize = DCU_DATA_SIZE_8BIT;
        pstcInit->u32CmpTriggerMode = DCU_CMP_TRIG_DATA0;
        pstcInit->u32IntEn = DCU_INT_DISABLE;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize DCU function.
 * @param [in] DCUx                     Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @retval None
 */
void DCU_DeInit(M4_DCU_TypeDef *DCUx)
{
    /* Configures the registers to reset value. */
    WRITE_REG32(DCUx->CTL, 0x00000000UL);
    WRITE_REG32(DCUx->INTEVTSEL, 0x00000000UL);
    WRITE_REG32(DCUx->FLAGCLR, 0x0000007FUL);
    WRITE_REG32(DCUx->DATA0, 0x00000000UL);
    WRITE_REG32(DCUx->DATA1, 0x00000000UL);
    WRITE_REG32(DCUx->DATA2, 0x00000000UL);
}

/**
 * @brief  Initialize DCU function.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 * @param  [in] pstcCfg                 Pointer to a @ref stc_dcu_wave_cfg_t structure (DCU wave function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcCfg is NULL pointer
 * @note   The DCU sawtooth/triangle wave mode is supported by M4_DCU1/2/3/4.
 */
en_result_t DCU_WaveCfg(M4_DCU_TypeDef *DCUx,
                           const stc_dcu_wave_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != pstcCfg)
    {
        DDL_ASSERT(IS_DCU_WAVE_FUNC_UNIT(DCUx));
        DDL_ASSERT(IS_DCU_WAVE_LOWER_LIMIT(pstcCfg->u32LowerLimit));
        DDL_ASSERT(IS_DCU_WAVE_UPPER_LIMIT(pstcCfg->u32UpperLimit));
        DDL_ASSERT(IS_DCU_WAVE_STEP(pstcCfg->u32Step));

        WRITE_REG32(DCUx->DATA0, 0x00000000UL);
        WRITE_REG32(DCUx->DATA1, ((pstcCfg->u32LowerLimit << DCU_DATA1_LOWER_LIMIT_POS) | \
                                  (pstcCfg->u32UpperLimit << DCU_DATA1_UPPER_LIMIT_POS)));
        WRITE_REG32(DCUx->DATA2, pstcCfg->u32Step);

