RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_dcu.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set DCU operation mode.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32Mode                 DCU mode
 *         This parameter can be one of the following values:
 *           @arg DCU_INVALID:          DCU invalid
 *           @arg DCU_ADD:              DCU add operation
 *           @arg DCU_SUB:              DCU sub operation
 *           @arg DCU_HW_ADD:           DCU hardware trigger add
 *           @arg DCU_HW_SUB:           DCU hardware trigger sub
 *           @arg DCU_CMP:              DCU compare
 *           @arg DCU_TRIANGLE_WAVE:    DCU triangle wave output mode
 *           @arg DCU_SAWTOOTH_WAVE_INC:DCU increasing sawtooth wave output mode
 *           @arg DCU_SAWTOOTH_WAVE_DEC:DCU decreasing sawtooth wave output mode
 * @retval None
 * @note   The DCU sawtooth/triangle wave mode is supported by M4_DCU1/2/3/4.
 */
void DCU_SetMode(M4_DCU_TypeDef *DCUx, uint32_t u32Mode)
{
    /* Check for parameters */
    DDL_ASSERT((IS_DCU_WAVE_FUNC_UNIT(DCUx) && IS_DCU_WAVE_FUNC_UNIT_MODE(u32Mode)) || \
               (IS_DCU_BASE_FUNC_UNIT(DCUx) && IS_DCU_BASE_FUNC_UNIT_MODE(u32Mode)));

    MODIFY_REG32(DCUx->CTL, DCU_CTL_MODE, u32Mode);
}

/**
 * @brief  Get DCU operation mode.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg DCU_INVALID:          DCU invalid
 *           @arg DCU_ADD:              DCU add operation
 *           @arg DCU_SUB:              DCU sub operation
 *           @arg DCU_HW_ADD:           DCU hardware trigger add
 *           @arg DCU_HW_SUB:           DCU hardware trigger sub
 *           @arg DCU_CMP:              DCU compare
 *           @arg DCU_TRIANGLE_WAVE:    DCU triangle wave output mode
 *           @arg DCU_SAWTOOTH_WAVE_INC:DCU increasing sawtooth wave output mode
 *           @arg DCU_SAWTOOTH_WAVE_DEC:DCU decreasing sawtooth wave output mode
 * @note   The DCU sawtooth/triangle wave mode is supported by M4_DCU1/2/3/4.
 */
uint32_t DCU_GetMode(const M4_DCU_TypeDef *DCUx)
{
    /* Check for DCUx pointer */
    DDL_ASSERT(IS_DCU_UNIT(DCUx));

    return READ_REG32_BIT(DCUx->CTL, DCU_CTL_MODE);
}

/**
 * @brief  Set DCU data size.
 * @param  [in] DCUx                     Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32DataSize             DCU data size
 *         This parameter can be one of the following values:
 *           @arg DCU_DATA_SIZE_8BIT:   DCU data size 8 bits
 *           @arg DCU_DATA_SIZE_16BIT:  DCU data size 16 bits
 *           @arg DCU_DATA_SIZE_32BIT:  DCU data size 32 bits
 * @retval None
 */
void DCU_SetDataSize(M4_DCU_TypeDef *DCUx, uint32_t u32DataSize)
{
    /* Check for DCUx pointer */
    DDL_ASSERT(IS_DCU_UNIT(DCUx));
    DDL_ASSERT(IS_DCU_DATA_SIZE(u32DataSize));

    MODIFY_REG32(DCUx->CTL, DCU_CTL_DATASIZE, u32DataSize);
}

/**
 * @brief  Get DCU data size.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg DCU_DATA_SIZE_8BIT:   DCU data size 8 bits
 *           @arg DCU_DATA_SIZE_16BIT:  DCU data size 16 bits
 *           @arg DCU_DATA_SIZE_32BIT:  DCU data size 32 bits
 */
uint32_t DCU_GetDataSize(const M4_DCU_TypeDef *DCUx)
{
    /* Check for DCUx pointer */
    DDL_ASSERT(IS_DCU_UNIT(DCUx));

    return READ_REG32_BIT(DCUx->CTL, DCU_CTL_DATASIZE);
}

/**
 * @brief  Get DCU flag.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32Flag                 The specified DCU flag
 *         This parameter can be one of the following values:
 *           @arg DCU_FLAG_OPERATION:       DCU addition overflow or subtraction underflow flag
 *           @arg DCU_FLAG_DATA0_LS_DATA2:  DCU DATA0 < DATA2 flag
 *           @arg DCU_FLAG_DATA0_EQ_DATA2:  DCU DATA0 = DATA2 flag
 *           @arg DCU_FLAG_DATA0_GT_DATA2:  DCU DATA0 > DATA2 flag
 *           @arg DCU_FLAG_DATA0_LS_DATA1:  DCU DATA0 < DATA1 flag
 *           @arg DCU_FLAG_DATA0_EQ_DATA1:  DCU DATA0 = DATA1 flag
 *           @arg DCU_FLAG_DATA0_GT_DATA1:  DCU DATA0 > DATA1 flag
 *           @arg DCU_FLAG_SAWTOOTH_WAVE_RELOAD:  DCU sawtooth wave mode reload flag
 *           @arg DCU_FLAG_TRIANGLE_WAVE_BOTTOM:  DCU triangle wave mode bottom flag
 *           @arg DCU_FLAG_TRIANGLE_WAVE_TOP: DCU triangle wave mode top flag
 * @retval Returned value can be one of the following values:
 *           @arg Set                         Flag is set.
 *           @arg Reset                       Flag is reset or enStatus is invalid.
 */
en_flag_status_t DCU_GetStatus(const M4_DCU_TypeDef *DCUx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT((IS_DCU_WAVE_FUNC_UNIT(DCUx) && IS_DCU_WAVE_FUNC_UNIT_FLAG(u32Flag)) || \
               (IS_DCU_BASE_FUNC_UNIT(DCUx) && IS_DCU_BASE_FUNC_UNIT_FLAG(u32Flag)));

    return READ_REG32_BIT(DCUx->FLAG, u32Flag) ? Set : Reset;
}

/**
 * @brief  Clear DCU flag.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32Flag                 The specified DCU flag
 *         This parameter can be one of the following values:
 *           @arg DCU_FLAG_OPERATION:       DCU addition overflow or subtraction underflow flag
 *           @arg DCU_FLAG_DATA0_LS_DATA2:  DCU DATA0 < DATA2 flag
 *           @arg DCU_FLAG_DATA0_EQ_DATA2:  DCU DATA0 = DATA2 flag
 *           @arg DCU_FLAG_DATA0_GT_DATA2:  DCU DATA0 > DATA2 flag
 *           @arg DCU_FLAG_DATA0_LS_DATA1:  DCU DATA0 < DATA1 flag
 *           @arg DCU_FLAG_DATA0_EQ_DATA1:  DCU DATA0 = DATA1 flag
 *           @arg DCU_FLAG_DATA0_GT_DATA1:  DCU DATA0 > DATA1 flag
 *           @arg DCU_FLAG_SAWTOOTH_WAVE_RELOAD:  DCU sawtooth wave mode reload flag
 *           @arg DCU_FLAG_TRIANGLE_WAVE_BOTTOM:  DCU triangle wave mode bottom flag
 *           @arg DCU_FLAG_TRIANGLE_WAVE_TOP: DCU triangle wave mode top flag
 * @retval None
 */
void DCU_ClearStatus(M4_DCU_TypeDef *DCUx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT((IS_DCU_WAVE_FUNC_UNIT(DCUx) && IS_DCU_WAVE_FUNC_UNIT_FLAG(u32Flag)) || \
               (IS_DCU_BASE_FUNC_UNIT(DCUx) && IS_DCU_BASE_FUNC_UNIT_FLAG(u32Flag)));

    WRITE_REG32(DCUx->FLAGCLR, u32Flag);
}

/**
 * @brief  Enable/disable DCU the specified interrupt source.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32IntCategory          DCU interrupt categorye
 *         This parameter can be one of the following values:
 *           @arg DCU_INT_OP:           DCU operation result(overflow/underflow) interrupt
 *           @arg DCU_INT_WAVE_MD:      DCU wave mode(sawtooth/triangle wave mode) interrupt
 *           @arg DCU_INT_CMP_WIN:      DCU comparison(window) interrupt
 *           @arg DCU_INT_CMP_NON_WIN:  DCU comparison(non-window) interrupt
 * @param  [in] u32IntType              DCU interrupt type
 *         This parameter can be one of the following case:
 *         a. this parameter can be one of the following values when u16IntType = DCU_INT_OP:
 *           @arg DCU_INT_OP_UDF_OVF: DCU addition overflow or subtraction underflow interrupt
 *         b. this parameter can be any composed value of the following values when u16IntType = DCU_INT_CMP_WIN:
 *           @arg DCU_INT_CMP_WIN_INSIDE:DCU comparison(DATA2 <= DATA0 <= DATA1) interrupt
 *           @arg DCU_INT_CMP_WIN_OUTSIDE: DCU comparison(DATA0 < DATA2 & DATA0 > DATA1 ) interrupt
 *           @note Only one of the window inside and outside interrupt is valid.
 *           @note Both of the window inside and outside interrupt is disabled and the window interrupt is invalid.
 *           @note Both of the window inside and outside interrupt is enabled and the compare mode interrupt is invalid.
 *         c. this parameter can be any composed value of the following values when u16IntType = DCU_INT_CMP_NON_WIN:
 *           @arg DCU_INT_CMP_DATA0_LS_DATA2: DCU DATA0 < DATA2 interrupt
 *           @arg DCU_INT_CMP_DATA0_EQ_DATA2: DCU DATA0 = DATA2 interrupt
 *           @arg DCU_INT_CMP_DATA0_GT_DATA2: DCU DATA0 > DATA2 interrupt
 *           @arg DCU_INT_CMP_DATA0_LS_DATA1: DCU DATA0 < DATA1 interrupt
 *           @arg DCU_INT_CMP_DATA0_EQ_DATA1: DCU DATA0 = DATA1 interrupt
 *           @arg DCU_INT_CMP_DATA0_GT_DATA1: DCU DATA0 > DATA1 interrupt
 *           @note Both of the window inside and outside interrupt is disabled and the compare non-window interrupt is valid.
 *         d. this parameter can be any composed value of the following values when u16IntType = DCU_INT_WAVE_MD:
 *           @arg DCU_INT_WAVE_SAWTOOTH_RELOAD: DCU sawtooth wave mode reload interrupt
 *           @arg DCU_INT_WAVE_TRIANGLE_BOTTOM: DCU triangle wave mode bottom interrupt
 *           @arg DCU_INT_WAVE_TRIANGLE_TOP:    DCU triangle wave mode top interrupt
 * @param  [in] enNewState              The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 * @note   The DCU sawtooth/triangle wave mode is supported by M4_DCU1/2/3/4.
 */
void DCU_IntCmd(M4_DCU_TypeDef *DCUx,
                uint32_t u32IntCategory,
                uint32_t u32IntType,
                en_functional_state_t enNewState)
{
    uint32_t u32Type;

    /* Check parameters */
    DDL_ASSERT(IS_DCU_UNIT(DCUx));
    DDL_ASSERT(IS_DCU_INT_CATEGORY(u32IntCategory));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DCU_INT_OP == u32IntCategory)
    {
        DDL_ASSERT(IS_DCU_INT_OP(u32IntType));
        u32Type = (u32IntType & DCU_INT_OP_UDF_OVF);
    }
    else if (DCU_INT_CMP_WIN == u32IntCategory)
    {
        DDL_ASSERT(IS_DCU_INT_CMP_WIN(u32IntType));
        u32Type = (u32IntType & DCU_INT_CMP_WIN_ALL);
    }
    else if (DCU_INT_CMP_NON_WIN == u32IntCategory)
    {
        DDL_ASSERT(IS_DCU_INT_CMP_NON_WIN(u32IntType));
        u32Type = (u32IntType & DCU_INT_CMP_NON_WIN_ALL);
    }
    else
    {
        DDL_ASSERT(IS_DCU_WAVE_FUNC_UNIT(DCUx));
        DDL_ASSERT(IS_DCU_INT_WAVE_MD(u32IntType));
        u32Type = (u32IntType & DCU_INT_WAVE_MD_ALL);
    }

