RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_dcu.c
    DATA = (__IO uint16_t *)DATA_REG_ADDR(DCUx, u32DataIndex);
    return READ_REG16(*DATA);
}

/**
 * @brief  Write DCU register DATA for half-word.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32DataIndex            DCU data register index
 *         This parameter can be one of the following values:
 *           @arg DCU_DATA0_IDX:        DCU DATA0
 *           @arg DCU_DATA1_IDX:        DCU DATA1
 *           @arg DCU_DATA2_IDX:        DCU DATA2
 * @param  [in] u16Data                 The data to write.
 * @retval None
 */
void DCU_WriteData16(M4_DCU_TypeDef *DCUx,
                        uint32_t u32DataIndex,
                        uint16_t u16Data)
{
    __IO uint16_t *DATA;

    /* Check parameters */
    DDL_ASSERT(IS_DCU_UNIT(DCUx));
    DDL_ASSERT(IS_DCU_DATA_REG(u32DataIndex));

    DATA = (__IO uint16_t *)DATA_REG_ADDR(DCUx, u32DataIndex);
    WRITE_REG16(*DATA, u16Data);
}

/**
 * @brief  Read DCU register DATA for word.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32DataIndex            DCU data register index
 *         This parameter can be one of the following values:
 *           @arg DCU_DATA0_IDX:        DCU DATA0
 *           @arg DCU_DATA1_IDX:        DCU DATA1
 *           @arg DCU_DATA2_IDX:        DCU DATA2
 * @retval DCU register DATA value for word
 */
uint32_t DCU_ReadData32(const M4_DCU_TypeDef *DCUx, uint32_t u32DataIndex)
{
    __IO uint32_t *DATA;

    /* Check parameters */
    DDL_ASSERT(IS_DCU_UNIT(DCUx));
    DDL_ASSERT(IS_DCU_DATA_REG(u32DataIndex));

    DATA = (__IO uint32_t *)DATA_REG_ADDR(DCUx, u32DataIndex);
    return READ_REG32(*DATA);
}

/**
 * @brief  Write DCU register DATA0 for word.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @param  [in] u32DataIndex            DCU data register index
 *         This parameter can be one of the following values:
 *           @arg DCU_DATA0_IDX:        DCU DATA0
 *           @arg DCU_DATA1_IDX:        DCU DATA1
 *           @arg DCU_DATA2_IDX:        DCU DATA2
 * @param  [in] u32Data                 The data to write.
 * @retval None
 */
void DCU_WriteData32(M4_DCU_TypeDef *DCUx,
                        uint32_t u32DataIndex,
                        uint32_t u32Data)
{
    __IO uint32_t *DATA;

    /* Check parameters */
    DDL_ASSERT(IS_DCU_UNIT(DCUx));
    DDL_ASSERT(IS_DCU_DATA_REG(u32DataIndex));

    DATA = (__IO uint32_t *)DATA_REG_ADDR(DCUx, u32DataIndex);
    WRITE_REG32(*DATA, u32Data);
}

/**
 * @}
 */

/**
 * @defgroup DCU_Local_Functions DCU Local Functions
 * @{
 */

/**
 * @brief  Get DCU trigger selection register of the specified DCU unit.
 * @param  [in] DCUx                    Pointer to DCU instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_DCU1:              DCU unit 1 instance register base
 *           @arg M4_DCU2:              DCU unit 2 instance register base
 *           @arg M4_DCU3:              DCU unit 3 instance register base
 *           @arg M4_DCU4:              DCU unit 4 instance register base
 *           @arg M4_DCU5:              DCU unit 5 instance register base
 *           @arg M4_DCU6:              DCU unit 6 instance register base
 *           @arg M4_DCU7:              DCU unit 7 instance register base
 *           @arg M4_DCU8:              DCU unit 8 instance register base
 * @retval DCU trigger selection register
 */
static __IO uint32_t* DCU_TRGSELx(const M4_DCU_TypeDef *DCUx)
{
    __IO uint32_t *TRGSELx;

    if ((M4_DCU1 == DCUx) || (M4_DCU5 == DCUx))
    {
        TRGSELx = &M4_AOS->DCU_1_TRGSEL;
    }
    else if ((M4_DCU2 == DCUx) || (M4_DCU6 == DCUx))
    {
        TRGSELx = &M4_AOS->DCU_2_TRGSEL;
    }
    else if ((M4_DCU3 == DCUx) || (M4_DCU7 == DCUx))
    {
        TRGSELx = &M4_AOS->DCU_3_TRGSEL;
    }
    else if ((M4_DCU4 == DCUx) || (M4_DCU8 == DCUx))
    {
        TRGSELx = &M4_AOS->DCU_4_TRGSEL;
    }
    else
    {
        TRGSELx = NULL;
    }

    return TRGSELx;
}

/**
 * @}
 */

#endif /* DDL_DCU_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
